trol73/avr-make/asm/include/ATxmega64A1Udef.inc
.equ ADCB_CTRLA = 576		// Control Register A
.equ ADCB_CTRLB = 577		// Control Register B
.equ ADCB_REFCTRL = 578		// Reference Control
.equ ADCB_EVCTRL = 579		// Event Control
.equ ADCB_PRESCALER = 580		// Clock Prescaler
.equ ADCB_INTFLAGS = 582		// Interrupt Flags
.equ ADCB_TEMP = 583		// Temporary Register
.equ ADCB_CAL = 588		// Calibration Value
.equ ADCB_CH0RES = 592		// Channel 0 Result
.equ ADCB_CH1RES = 594		// Channel 1 Result
.equ ADCB_CH2RES = 596		// Channel 2 Result
.equ ADCB_CH3RES = 598		// Channel 3 Result
.equ ADCB_CMP = 600		// Compare Value
.equ ADCB_CH0_CTRL = 608		// Control Register
.equ ADCB_CH0_MUXCTRL = 609		// MUX Control
.equ ADCB_CH0_INTCTRL = 610		// Channel Interrupt Control Register
.equ ADCB_CH0_INTFLAGS = 611		// Interrupt Flags
.equ ADCB_CH0_RES = 612		// Channel Result
.equ ADCB_CH0_SCAN = 614		// Input Channel Scan
.equ ADCB_CH1_CTRL = 616		// Control Register
.equ ADCB_CH1_MUXCTRL = 617		// MUX Control
.equ ADCB_CH1_INTCTRL = 618		// Channel Interrupt Control Register
.equ ADCB_CH1_INTFLAGS = 619		// Interrupt Flags
.equ ADCB_CH1_RES = 620		// Channel Result
.equ ADCB_CH1_SCAN = 622		// Input Channel Scan
.equ ADCB_CH2_CTRL = 624		// Control Register
.equ ADCB_CH2_MUXCTRL = 625		// MUX Control
.equ ADCB_CH2_INTCTRL = 626		// Channel Interrupt Control Register
.equ ADCB_CH2_INTFLAGS = 627		// Interrupt Flags
.equ ADCB_CH2_RES = 628		// Channel Result
.equ ADCB_CH2_SCAN = 630		// Input Channel Scan
.equ ADCB_CH3_CTRL = 632		// Control Register
.equ ADCB_CH3_MUXCTRL = 633		// MUX Control
.equ ADCB_CH3_INTCTRL = 634		// Channel Interrupt Control Register
.equ ADCB_CH3_INTFLAGS = 635		// Interrupt Flags
.equ ADCB_CH3_RES = 636		// Channel Result
.equ ADCB_CH3_SCAN = 638		// Input Channel Scan

;***************************************************************************
;** DACA - Digital to Analog Converter A
;***************************************************************************
	
.equ DACA_CTRLA = 768		// Control Register A
.equ DACA_CTRLB = 769		// Control Register B
.equ DACA_CTRLC = 770		// Control Register C
.equ DACA_EVCTRL = 771		// Event Input Control
.equ DACA_TIMCTRL = 772		// Timing Control
.equ DACA_STATUS = 773		// Status
.equ DACA_CH0GAINCAL = 776		// Gain Calibration
.equ DACA_CH0OFFSETCAL = 777		// Offset Calibration
.equ DACA_CH1GAINCAL = 778		// Gain Calibration
.equ DACA_CH1OFFSETCAL = 779		// Offset Calibration
.equ DACA_CH0DATA = 792		// Channel 0 Data
.equ DACA_CH1DATA = 794		// Channel 1 Data

;***************************************************************************
;** DACB - Digital to Analog Converter B
;***************************************************************************
	
.equ DACB_CTRLA = 800		// Control Register A
.equ DACB_CTRLB = 801		// Control Register B
.equ DACB_CTRLC = 802		// Control Register C
.equ DACB_EVCTRL = 803		// Event Input Control
.equ DACB_TIMCTRL = 804		// Timing Control
.equ DACB_STATUS = 805		// Status
.equ DACB_CH0GAINCAL = 808		// Gain Calibration
.equ DACB_CH0OFFSETCAL = 809		// Offset Calibration
.equ DACB_CH1GAINCAL = 810		// Gain Calibration
.equ DACB_CH1OFFSETCAL = 811		// Offset Calibration
.equ DACB_CH0DATA = 824		// Channel 0 Data
.equ DACB_CH1DATA = 826		// Channel 1 Data

;***************************************************************************
;** ACA - Analog Comparator A
;***************************************************************************
	
.equ ACA_AC0CTRL = 896		// Analog Comparator 0 Control
.equ ACA_AC1CTRL = 897		// Analog Comparator 1 Control
.equ ACA_AC0MUXCTRL = 898		// Analog Comparator 0 MUX Control
.equ ACA_AC1MUXCTRL = 899		// Analog Comparator 1 MUX Control
.equ ACA_CTRLA = 900		// Control Register A
.equ ACA_CTRLB = 901		// Control Register B
.equ ACA_WINCTRL = 902		// Window Mode Control
.equ ACA_STATUS = 903		// Status

;***************************************************************************
;** ACB - Analog Comparator B
;***************************************************************************
	
.equ ACB_AC0CTRL = 912		// Analog Comparator 0 Control
.equ ACB_AC1CTRL = 913		// Analog Comparator 1 Control
.equ ACB_AC0MUXCTRL = 914		// Analog Comparator 0 MUX Control
.equ ACB_AC1MUXCTRL = 915		// Analog Comparator 1 MUX Control
.equ ACB_CTRLA = 916		// Control Register A
.equ ACB_CTRLB = 917		// Control Register B
.equ ACB_WINCTRL = 918		// Window Mode Control
.equ ACB_STATUS = 919		// Status

;***************************************************************************
;** RTC - Real-Time Counter
;***************************************************************************
	
.equ RTC_CTRL = 1024		// Control Register
.equ RTC_STATUS = 1025		// Status Register
.equ RTC_INTCTRL = 1026		// Interrupt Control Register
.equ RTC_INTFLAGS = 1027		// Interrupt Flags
.equ RTC_TEMP = 1028		// Temporary register
.equ RTC_CNT = 1032		// Count Register
.equ RTC_PER = 1034		// Period Register
.equ RTC_COMP = 1036		// Compare Register

;***************************************************************************
;** EBI - External Bus Interface
;***************************************************************************
	
.equ EBI_CTRL = 1088		// Control
.equ EBI_SDRAMCTRLA = 1089		// SDRAM Control Register A
.equ EBI_REFRESH = 1092		// SDRAM Refresh Period
.equ EBI_INITDLY = 1094		// SDRAM Initialization Delay
.equ EBI_SDRAMCTRLB = 1096		// SDRAM Control Register B
.equ EBI_SDRAMCTRLC = 1097		// SDRAM Control Register C
.equ EBI_CS0_CTRLA = 1104		// Chip Select Control Register A
.equ EBI_CS0_CTRLB = 1105		// Chip Select Control Register B
.equ EBI_CS0_BASEADDR = 1106		// Chip Select Base Address
.equ EBI_CS1_CTRLA = 1108		// Chip Select Control Register A
.equ EBI_CS1_CTRLB = 1109		// Chip Select Control Register B
.equ EBI_CS1_BASEADDR = 1110		// Chip Select Base Address
.equ EBI_CS2_CTRLA = 1112		// Chip Select Control Register A
.equ EBI_CS2_CTRLB = 1113		// Chip Select Control Register B
.equ EBI_CS2_BASEADDR = 1114		// Chip Select Base Address
.equ EBI_CS3_CTRLA = 1116		// Chip Select Control Register A
.equ EBI_CS3_CTRLB = 1117		// Chip Select Control Register B
.equ EBI_CS3_BASEADDR = 1118		// Chip Select Base Address

;***************************************************************************
;** TWIC - Two-Wire Interface C
;***************************************************************************
	
.equ TWIC_CTRL = 1152		// TWI Common Control Register
.equ TWIC_MASTER_CTRLA = 1153		// Control Register A
.equ TWIC_MASTER_CTRLB = 1154		// Control Register B
.equ TWIC_MASTER_CTRLC = 1155		// Control Register C
.equ TWIC_MASTER_STATUS = 1156		// Status Register
.equ TWIC_MASTER_BAUD = 1157		// Baurd Rate Control Register
.equ TWIC_MASTER_ADDR = 1158		// Address Register
.equ TWIC_MASTER_DATA = 1159		// Data Register
.equ TWIC_SLAVE_CTRLA = 1160		// Control Register A
.equ TWIC_SLAVE_CTRLB = 1161		// Control Register B
.equ TWIC_SLAVE_STATUS = 1162		// Status Register
.equ TWIC_SLAVE_ADDR = 1163		// Address Register
.equ TWIC_SLAVE_DATA = 1164		// Data Register
.equ TWIC_SLAVE_ADDRMASK = 1165		// Address Mask Register

;***************************************************************************
;** TWID - Two-Wire Interface D
;***************************************************************************
	
.equ TWID_CTRL = 1168		// TWI Common Control Register
.equ TWID_MASTER_CTRLA = 1169		// Control Register A
.equ TWID_MASTER_CTRLB = 1170		// Control Register B
.equ TWID_MASTER_CTRLC = 1171		// Control Register C
.equ TWID_MASTER_STATUS = 1172		// Status Register
.equ TWID_MASTER_BAUD = 1173		// Baurd Rate Control Register
.equ TWID_MASTER_ADDR = 1174		// Address Register
.equ TWID_MASTER_DATA = 1175		// Data Register
.equ TWID_SLAVE_CTRLA = 1176		// Control Register A
.equ TWID_SLAVE_CTRLB = 1177		// Control Register B
.equ TWID_SLAVE_STATUS = 1178		// Status Register
.equ TWID_SLAVE_ADDR = 1179		// Address Register
.equ TWID_SLAVE_DATA = 1180		// Data Register
.equ TWID_SLAVE_ADDRMASK = 1181		// Address Mask Register

;***************************************************************************
;** TWIE - Two-Wire Interface E
;***************************************************************************
	
.equ TWIE_CTRL = 1184		// TWI Common Control Register
.equ TWIE_MASTER_CTRLA = 1185		// Control Register A
.equ TWIE_MASTER_CTRLB = 1186		// Control Register B
.equ TWIE_MASTER_CTRLC = 1187		// Control Register C
.equ TWIE_MASTER_STATUS = 1188		// Status Register
.equ TWIE_MASTER_BAUD = 1189		// Baurd Rate Control Register
.equ TWIE_MASTER_ADDR = 1190		// Address Register
.equ TWIE_MASTER_DATA = 1191		// Data Register
.equ TWIE_SLAVE_CTRLA = 1192		// Control Register A
.equ TWIE_SLAVE_CTRLB = 1193		// Control Register B
.equ TWIE_SLAVE_STATUS = 1194		// Status Register
.equ TWIE_SLAVE_ADDR = 1195		// Address Register
.equ TWIE_SLAVE_DATA = 1196		// Data Register
.equ TWIE_SLAVE_ADDRMASK = 1197		// Address Mask Register

;***************************************************************************
;** TWIF - Two-Wire Interface F
;***************************************************************************
	
