trol73/avr-make/asm/include/ATxmega64A1Udef.inc
; PORTCFG_CLKEVOUT masks
.equ PORTCFG_CLKOUT_gm = 0x03 ; Peripheral Clock Output Port group mask
.equ PORTCFG_CLKOUT_gp = 0 ; Peripheral Clock Output Port group position
.equ PORTCFG_CLKOUT0_bm = (1<<0) ; Peripheral Clock Output Port bit 0 mask
.equ PORTCFG_CLKOUT0_bp = 0 ; Peripheral Clock Output Port bit 0 position
.equ PORTCFG_CLKOUT1_bm = (1<<1) ; Peripheral Clock Output Port bit 1 mask
.equ PORTCFG_CLKOUT1_bp = 1 ; Peripheral Clock Output Port bit 1 position
.equ PORTCFG_CLKOUTSEL_gm = 0x0C ; Peripheral Clock Output Select group mask
.equ PORTCFG_CLKOUTSEL_gp = 2 ; Peripheral Clock Output Select group position
.equ PORTCFG_CLKOUTSEL0_bm = (1<<2) ; Peripheral Clock Output Select bit 0 mask
.equ PORTCFG_CLKOUTSEL0_bp = 2 ; Peripheral Clock Output Select bit 0 position
.equ PORTCFG_CLKOUTSEL1_bm = (1<<3) ; Peripheral Clock Output Select bit 1 mask
.equ PORTCFG_CLKOUTSEL1_bp = 3 ; Peripheral Clock Output Select bit 1 position
.equ PORTCFG_EVOUT_gm = 0x30 ; Event Output Port group mask
.equ PORTCFG_EVOUT_gp = 4 ; Event Output Port group position
.equ PORTCFG_EVOUT0_bm = (1<<4) ; Event Output Port bit 0 mask
.equ PORTCFG_EVOUT0_bp = 4 ; Event Output Port bit 0 position
.equ PORTCFG_EVOUT1_bm = (1<<5) ; Event Output Port bit 1 mask
.equ PORTCFG_EVOUT1_bp = 5 ; Event Output Port bit 1 position
.equ PORTCFG_RTCOUT_bm = 0x40 ; RTC Clock Output bit mask
.equ PORTCFG_RTCOUT_bp = 6 ; RTC Clock Output bit position
.equ PORTCFG_CLKEVPIN_bm = 0x80 ; Peripheral Clock and Event Output pin Select bit mask
.equ PORTCFG_CLKEVPIN_bp = 7 ; Peripheral Clock and Event Output pin Select bit position

; PORTCFG_EVOUTSEL masks
.equ PORTCFG_EVOUTSEL_gm = 0x07 ; Event Output Select group mask
.equ PORTCFG_EVOUTSEL_gp = 0 ; Event Output Select group position
.equ PORTCFG_EVOUTSEL0_bm = (1<<0) ; Event Output Select bit 0 mask
.equ PORTCFG_EVOUTSEL0_bp = 0 ; Event Output Select bit 0 position
.equ PORTCFG_EVOUTSEL1_bm = (1<<1) ; Event Output Select bit 1 mask
.equ PORTCFG_EVOUTSEL1_bp = 1 ; Event Output Select bit 1 position
.equ PORTCFG_EVOUTSEL2_bm = (1<<2) ; Event Output Select bit 2 mask
.equ PORTCFG_EVOUTSEL2_bp = 2 ; Event Output Select bit 2 position
 
; Virtual Port Mapping
.equ PORTCFG_VP02MAP_PORTA_gc = (0x00<<0) ; Mapped To PORTA
.equ PORTCFG_VP02MAP_PORTB_gc = (0x01<<0) ; Mapped To PORTB
.equ PORTCFG_VP02MAP_PORTC_gc = (0x02<<0) ; Mapped To PORTC
.equ PORTCFG_VP02MAP_PORTD_gc = (0x03<<0) ; Mapped To PORTD
.equ PORTCFG_VP02MAP_PORTE_gc = (0x04<<0) ; Mapped To PORTE
.equ PORTCFG_VP02MAP_PORTF_gc = (0x05<<0) ; Mapped To PORTF
.equ PORTCFG_VP02MAP_PORTG_gc = (0x06<<0) ; Mapped To PORTG
.equ PORTCFG_VP02MAP_PORTH_gc = (0x07<<0) ; Mapped To PORTH
.equ PORTCFG_VP02MAP_PORTJ_gc = (0x08<<0) ; Mapped To PORTJ
.equ PORTCFG_VP02MAP_PORTK_gc = (0x09<<0) ; Mapped To PORTK
.equ PORTCFG_VP02MAP_PORTL_gc = (0x0A<<0) ; Mapped To PORTL
.equ PORTCFG_VP02MAP_PORTM_gc = (0x0B<<0) ; Mapped To PORTM
.equ PORTCFG_VP02MAP_PORTN_gc = (0x0C<<0) ; Mapped To PORTN
.equ PORTCFG_VP02MAP_PORTP_gc = (0x0D<<0) ; Mapped To PORTP
.equ PORTCFG_VP02MAP_PORTQ_gc = (0x0E<<0) ; Mapped To PORTQ
.equ PORTCFG_VP02MAP_PORTR_gc = (0x0F<<0) ; Mapped To PORTR

; Virtual Port Mapping
.equ PORTCFG_VP13MAP_PORTA_gc = (0x00<<4) ; Mapped To PORTA
.equ PORTCFG_VP13MAP_PORTB_gc = (0x01<<4) ; Mapped To PORTB
.equ PORTCFG_VP13MAP_PORTC_gc = (0x02<<4) ; Mapped To PORTC
.equ PORTCFG_VP13MAP_PORTD_gc = (0x03<<4) ; Mapped To PORTD
.equ PORTCFG_VP13MAP_PORTE_gc = (0x04<<4) ; Mapped To PORTE
.equ PORTCFG_VP13MAP_PORTF_gc = (0x05<<4) ; Mapped To PORTF
.equ PORTCFG_VP13MAP_PORTG_gc = (0x06<<4) ; Mapped To PORTG
.equ PORTCFG_VP13MAP_PORTH_gc = (0x07<<4) ; Mapped To PORTH
.equ PORTCFG_VP13MAP_PORTJ_gc = (0x08<<4) ; Mapped To PORTJ
.equ PORTCFG_VP13MAP_PORTK_gc = (0x09<<4) ; Mapped To PORTK
.equ PORTCFG_VP13MAP_PORTL_gc = (0x0A<<4) ; Mapped To PORTL
.equ PORTCFG_VP13MAP_PORTM_gc = (0x0B<<4) ; Mapped To PORTM
.equ PORTCFG_VP13MAP_PORTN_gc = (0x0C<<4) ; Mapped To PORTN
.equ PORTCFG_VP13MAP_PORTP_gc = (0x0D<<4) ; Mapped To PORTP
.equ PORTCFG_VP13MAP_PORTQ_gc = (0x0E<<4) ; Mapped To PORTQ
.equ PORTCFG_VP13MAP_PORTR_gc = (0x0F<<4) ; Mapped To PORTR

; System Clock Output Port
.equ PORTCFG_CLKOUT_OFF_gc = (0x00<<0) ; System Clock Output Disabled
.equ PORTCFG_CLKOUT_PC7_gc = (0x01<<0) ; System Clock Output on Port C pin 7
.equ PORTCFG_CLKOUT_PD7_gc = (0x02<<0) ; System Clock Output on Port D pin 7
.equ PORTCFG_CLKOUT_PE7_gc = (0x03<<0) ; System Clock Output on Port E pin 7

; Peripheral Clock Output Select
.equ PORTCFG_CLKOUTSEL_CLK1X_gc = (0x00<<2) ; 1x Peripheral Clock Output to pin
.equ PORTCFG_CLKOUTSEL_CLK2X_gc = (0x01<<2) ; 2x Peripheral Clock Output to pin
.equ PORTCFG_CLKOUTSEL_CLK4X_gc = (0x02<<2) ; 4x Peripheral Clock Output to pin

; Event Output Port
.equ PORTCFG_EVOUT_OFF_gc = (0x00<<4) ; Event Output Disabled
.equ PORTCFG_EVOUT_PC7_gc = (0x01<<4) ; Event Channel 7 Output on Port C pin 7
.equ PORTCFG_EVOUT_PD7_gc = (0x02<<4) ; Event Channel 7 Output on Port D pin 7
.equ PORTCFG_EVOUT_PE7_gc = (0x03<<4) ; Event Channel 7 Output on Port E pin 7

; Clock and Event Output Port
.equ PORTCFG_CLKEVPIN_PIN7_gc = (0x00<<7) ; Clock and Event Ouput on PIN 7
.equ PORTCFG_CLKEVPIN_PIN4_gc = (0x01<<7) ; Clock and Event Ouput on PIN 4

; Event Output Select
.equ PORTCFG_EVOUTSEL_0_gc = (0x00<<0) ; Event Channel 0 output to pin
.equ PORTCFG_EVOUTSEL_1_gc = (0x01<<0) ; Event Channel 1 output to pin
.equ PORTCFG_EVOUTSEL_2_gc = (0x02<<0) ; Event Channel 2 output to pin
.equ PORTCFG_EVOUTSEL_3_gc = (0x03<<0) ; Event Channel 3 output to pin
.equ PORTCFG_EVOUTSEL_4_gc = (0x04<<0) ; Event Channel 4 output to pin
.equ PORTCFG_EVOUTSEL_5_gc = (0x05<<0) ; Event Channel 5 output to pin
.equ PORTCFG_EVOUTSEL_6_gc = (0x06<<0) ; Event Channel 6 output to pin
.equ PORTCFG_EVOUTSEL_7_gc = (0x07<<0) ; Event Channel 7 output to pin


;***************************************************************************
;** AES - AES Module
;***************************************************************************/

